[
  {
    "title": "P4sspl01t Ethical Security Tool",
    "date_start": "2025-10-01",
    "date_end": "2025-10-31",
    "status": "completed",
    "description": "A hybrid offensive and defensive password security tool developed across multiple weeks. Features include password generation, brute-force and dictionary cracking, breach detection, entropy analysis, and security recommendations. Built by three internal teams during weekly project meets.",
    "repo": "https://github.com/HamishDS/BCU_Cybersecurity_P4sspl01t",
    "contributors": [
      "Michael Martinak (Project Lead)",
      "Hamish Dobson-Smyth",
      "Baber Khan",
      "Shaun",
      "Zak Miah",
      "Shakayat Ali Bhuiyan",
      "Al Tahsin Rafi",
      "Umar Al-Mahfuz"
    ],
    "location": "Curzon C383"
  },

  {
    "title": "Game Off 2025: Multi-Society Collaboration",
    "date_start": "2025-11-01",
    "date_end": null,
    "status": "in-progress",
    "description": "A collaborative project between the BCU Computer Science, Data Science, and Cyber Security societies for Itch.io's Game Off 2025. CompSci and DataSci teams focus on game development, design, and gameplay systems, while Cybersoc contributes by reverse-engineering builds, analysing binaries, testing memory safety, identifying vulnerabilities, and providing security-focused insights to improve the robustness of the games. Weekly Wednesday sessions involve debugging, RE tooling, patching, and secure coding guidance.",
    "repo": "",
    "contributors": [
      "Michael Martinak (Co-Project Lead)",
      "Tayyeb Nadeem Somro (Co-Project Lead)",
      "Hamish Dobson-Smyth",
      "Shaun",
      "Shakayat Ali Bhuiyan"
    ],
    "location": "Curzon C383"
  },
  {
    "title": "Cybersoc Website (Official Society Platform)",
    "date_start": "2025-11-01",
    "date_end": null,
    "status": "in-progress",
    "description": "The official website for the BCU Cyber Security Society, built using React, Tailwind CSS, Zustand, and a structured JSON-driven content system. The project aims to create a clean, accessible, professional digital presence to showcase events, projects, resources, and the committee. Designed with long-term maintainability and ease of updates in mind.",
    "repo": "",
    "contributors": ["Baber Khan (Project Lead)", "Michael Martinak"],
    "location": "Independent Development + Curzon C383"
  }
]
